<a href="https://colab.research.google.com/github/awaisniaz/Machine_learning/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
arr = [1,2,3,5,6]
index = ['a','b','c','d','e']
colums = ['index','marks']
pd.Series(data=arr,index=index)

a    1
b    2
c    3
d    5
e    6
dtype: int64

In [15]:
from numpy.random import randn
import numpy as np
np.random.seed(1)

dataFrame = pd.DataFrame(randn(10,5),columns='A B C D E'.split())
dataFrame['A']

0    1.624345
1   -2.301539
2    1.462108
3   -1.099891
4   -1.100619
5   -0.683728
6   -0.691661
7   -0.012665
8   -0.191836
9   -0.636996
Name: A, dtype: float64

**Selecting Rows**

In [18]:
dataFrame.loc[1:4,'A']

1   -2.301539
2    1.462108
3   -1.099891
4   -1.100619
Name: A, dtype: float64

# **Merging**

In [21]:
data1 = pd.DataFrame({'ID':['101','102','103'],
                      'Sale':[123,123,453]})
data2 = pd.DataFrame({'ID':['101','102','103'],
                      'Sale':[123,123,453]})

In [24]:
pd.concat([data1,data2],ignore_index=True,axis=1)

     0    1    2    3
0  101  123  101  123
1  102  123  102  123
2  103  453  103  453